### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_api_management_api.wallet_user_ioapp_v1 will be updated in-place
  ~ resource "azurerm_api_management_api" "wallet_user_ioapp_v1" {
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/wallet-user-ioapp-api-v1;rev=1"
        name                  = "wallet-user-ioapp-api-v1"
      ~ path                  = "api/echo" -> "api/wallet"
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_api_management_api_policy.wallet_user_uat_v1 will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "wallet_user_uat_v1" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/wallet-user-uat-ioapp-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          + <policies>
          - 	<inbound>
          +   <inbound>
          - 		<include-fragment fragment-id="io-wallet-app-session-fragment" />
          +       <include-fragment fragment-id="io-wallet-app-session-fragment" />
          - 		<base />
          +       <base />
          - 		<!--<rewrite-uri template="@("/api/wallet/uat/v1/" + context.Request.Url.Path)" />-->
          +       <rewrite-uri template="@("/api/wallet/uat/v1/" + context.Request.Url.Path)" />
          - 		<set-backend-service backend-id="psn-uat-backend-01" />
          +       <set-backend-service backend-id="psn-backend-01" />
          - 	</inbound>
          +   </inbound>
          - 	<backend>
          +   <backend>
          - 		<base />
          +     <base />
          - 	</backend>
          +   </backend>
          - 	<outbound>
          +   <outbound>
          - 		<base />
          +     <base />
          - 	</outbound>
          +   </outbound>
          - 	<on-error>
          +   <on-error>
          - 		<base />
          +     <base />
          - 	</on-error>
          +   </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # azurerm_api_management_api_policy.wallet_user_v1 will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "wallet_user_v1" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/wallet-user-ioapp-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          + <policies>
          - 	<inbound>
          +   <inbound>
          - 		<include-fragment fragment-id="io-wallet-app-session-fragment" />
          +       <include-fragment fragment-id="io-wallet-app-session-fragment" />
          - 		<base />
          +       <base />
          - 		<!--<rewrite-uri template="@("/api/wallet/v1/" + context.Request.Url.Path)" />-->
          +       <rewrite-uri template="@("/api/wallet/v1/" + context.Request.Url.Path)" />
          - 		<set-backend-service backend-id="psn-backend-01" />
          +       <set-backend-service backend-id="psn-backend-01" />
          - 	</inbound>
          +   </inbound>
          - 	<backend>
          +   <backend>
          - 		<base />
          +     <base />
          - 	</backend>
          +   </backend>
          - 	<outbound>
          +   <outbound>
          - 		<base />
          +     <base />
          - 	</outbound>
          +   </outbound>
          - 	<on-error>
          +   <on-error>
          - 		<base />
          +     <base />
          - 	</on-error>
          +   </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # azurerm_api_management_backend.psn will be updated in-place
  ~ resource "azurerm_api_management_backend" "psn" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/backends/psn-backend-01"
        name                = "psn-backend-01"
      ~ url                 = "https://api.internal.wallet.io.pagopa.it/api/wallet/v1" -> "https://api.internal.wallet.io.pagopa.it/"
        # (6 unchanged attributes hidden)

      - credentials {
          - certificate = [] -> null
          - header      = {} -> null
          - query       = {} -> null
        }

      - tls {
          - validate_certificate_chain = false -> null
          - validate_certificate_name  = false -> null
        }
    }

  # azurerm_api_management_policy_fragment.wallet_authentication will be updated in-place
  ~ resource "azurerm_api_management_policy_fragment" "wallet_authentication" {
        id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/policyFragments/io-wallet-app-session-fragment"
        name              = "io-wallet-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          - 	<choose>
          - 		<when condition="@(!context.Variables.ContainsKey("skipSessionFragment"))">
          - 			<!-- Extract the token from the Authorization Header -->
          - 			<set-variable name="token" value="@{
          + <fragment>
          + 	<!-- Extract the token from the Authorization Header -->
          +   <set-variable name="token" value="@{
                string[] values;
                return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
          -   }" />
          - 			<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 			<choose>
          - 				<when condition="@(
          +   }" />
          +   <!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          +   <choose>
          +     <when condition="@(
                  string.IsNullOrEmpty((string)context.Variables["token"]) ||
                  !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
                  string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
          -     )">
          - 					<set-header name="Content-Type" exists-action="override">
          - 						<value>application/json</value>
          - 					</set-header>
          - 					<return-response>
          - 						<set-status code="401" reason="Unauthorized" />
          - 						<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 					</return-response>
          - 				</when>
          - 			</choose>
          - 			<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 			<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 				<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 				<set-method>GET</set-method>
          - 				<set-header name="Content-Type" exists-action="override">
          - 					<value>application/json</value>
          - 				</set-header>
          - 				<set-header name="Authorization" exists-action="override">
          - 					<value>@(((string)context.Variables["token"]))</value>
          - 				</set-header>
          - 			</send-request>
          - 			<choose>
          - 				<!-- If 200 return set the x-user header as the base64 of the response -->
          - 				<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
          - 					<!-- Parse the introspectionResponse as a string -->
          - 					<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())" />
          - 					<!-- Remove the Authorization Header -->
          - 					<set-header name="Authorization" exists-action="delete" />
          - 					<!-- Set the x-user header with the user data -->
          - 					<set-header name="x-user" exists-action="override">
          - 						<value>@(
          +     )">
          +       <set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          +       </set-header>
          +       <return-response>
          +         <set-status code="401" reason="Unauthorized" />
          +         <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +       </return-response>
          +   </when>
          +   </choose>
          +   <!-- Call the session manager, pasing the bearer token, to get the user identity -->
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-method>GET</set-method>
          + 		<set-header name="Content-Type" exists-action="override">
          +       <value>application/json</value>
          + 		</set-header>
          + 		<set-header name="Authorization" exists-action="override">
          +       <value>@(((string)context.Variables["token"]))</value>
          + 		</set-header>
          + 	</send-request>
          + 	<choose>
          +     <!-- If 200 return set the x-user header as the base64 of the response -->
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
          + 			<!-- Parse the introspectionResponse as a string -->
          + 			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())" />
          + 			<!-- Remove the Authorization Header -->
          + 			<set-header name="Authorization" exists-action="delete" />
          + 			<!-- Set the x-user header with the user data -->
          + 			<set-header name="x-user" exists-action="override">
          + 				<value>@(
                      Convert.ToBase64String(
                          System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
                      )
          -         )</value>
          - 					</set-header>
          - 				</when>
          - 				<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
          - 					<return-response response-variable-name="introspectionErrorResponse">
          - 						<set-status code="401" reason="Unauthorized" />
          - 						<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 					</return-response>
          - 				</when>
          - 				<otherwise>
          - 					<set-header name="Content-Type" exists-action="override">
          - 						<value>application/json</value>
          - 					</set-header>
          - 					<return-response response-variable-name="introspectionErrorResponse">
          - 						<set-status code="500" reason="Internal Server Error" />
          - 						<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 					</return-response>
          - 				</otherwise>
          - 			</choose>
          - 		</when>
          - 	</choose>
          +         )</value>
          + 			</set-header>
          + 		</when>
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="401" reason="Unauthorized" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 			</return-response>
          + 		</when>
          + 		<otherwise>
          + 			<set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          + 			</set-header>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="500" reason="Internal Server Error" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +         </return-response>
          + 		</otherwise>
          + 	</choose>
            </fragment>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.apim_itn.azurerm_api_management_api_tag.wallet_admin will be created
  + resource "azurerm_api_management_api_tag" "wallet_admin" {
      + api_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-wallet-admin-api;rev=1"
      + id     = (known after apply)
      + name   = "itwallet"
    }

  # module.apim_itn.azurerm_api_management_api_tag.wallet_app will be created
  + resource "azurerm_api_management_api_tag" "wallet_app" {
      + api_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-wallet-app-api;rev=1"
      + id     = (known after apply)
      + name   = "itwallet"
    }

  # module.apim_itn.azurerm_api_management_api_tag.wallet_pdnd will be created
  + resource "azurerm_api_management_api_tag" "wallet_pdnd" {
      + api_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-wallet-pdnd-api;rev=1"
      + id     = (known after apply)
      + name   = "itwallet"
    }

  # module.apim_itn.azurerm_api_management_api_tag.wallet_web will be created
  + resource "azurerm_api_management_api_tag" "wallet_web" {
      + api_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-wallet"
      + id     = (known after apply)
      + name   = "itwallet"
    }

  # module.storage_accounts.azurerm_storage_container.cosmos_01_backup will be destroyed
  # (because azurerm_storage_container.cosmos_01_backup is not in configuration)
  - resource "azurerm_storage_container" "cosmos_01_backup" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/blobServices/default/containers/cosmos-01-backup" -> null
      - metadata                          = {} -> null
      - name                              = "cosmos-01-backup" -> null
      - resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/blobServices/default/containers/cosmos-01-backup" -> null
      - storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
        # (1 unchanged attribute hidden)
    }

  # module.storage_accounts.azurerm_storage_container.input will be destroyed
  # (because azurerm_storage_container.input is not in configuration)
  - resource "azurerm_storage_container" "input" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/blobServices/default/containers/input" -> null
      - metadata                          = {} -> null
      - name                              = "input" -> null
      - resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/blobServices/default/containers/input" -> null
      - storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
        # (1 unchanged attribute hidden)
    }

  # module.storage_accounts.azurerm_storage_container.output will be destroyed
  # (because azurerm_storage_container.output is not in configuration)
  - resource "azurerm_storage_container" "output" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/blobServices/default/containers/output" -> null
      - metadata                          = {} -> null
      - name                              = "output" -> null
      - resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/blobServices/default/containers/output" -> null
      - storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
        # (1 unchanged attribute hidden)
    }

  # module.apim_itn.module.apim_v2_web_wallet_api.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
      + description           = "Wallet APIs"
      ~ display_name          = "IO Wallet - IO Web API" -> "IO Web - Wallet"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-wallet"
        name                  = "io-p-ioweb-wallet"
        # (15 unchanged attributes hidden)

      ~ import {
          ~ content_value  = jsonencode(
              ~ {
                  ~ info       = {
                      ~ title   = "IO Wallet - IO Web API" -> "IO Web - Wallet"
                        # (1 unchanged attribute hidden)
                    }
                    # (4 unchanged attributes hidden)
                }
            )
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "AzureWebJobs.migrateWalletInstances.Disabled"                                                     = "0"
          + "CosmosAccountConnectionString"                                                                    = "CosmosAccountConnectionString"
            # (75 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "4.1.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (9 unchanged elements hidden)
                "AzureWebJobs.sendEmailOnWalletInstanceRevocation.Disabled",
              + "AzureWebJobs.migrateWalletInstances.Disabled",
            ]
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "AzureWebJobs.migrateWalletInstances.Disabled"                                                     = "1"
          + "CosmosAccountConnectionString"                                                                    = "CosmosAccountConnectionString"
            # (76 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "AzureWebJobs.migrateWalletInstances.Disabled"                                                     = "1"
          + "CosmosAccountConnectionString"                                                                    = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=CosmosAccountConnectionString)"
            # (75 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01"
        name                                           = "io-u-itn-wallet-user-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "AzureWebJobs.migrateWalletInstances.Disabled"                                                     = "1"
          + "CosmosAccountConnectionString"                                                                    = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=CosmosAccountConnectionString)"
            # (76 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.blob["iopitnwalletst01|*|owner|Storage Blob Data Owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow admins to manage blobs"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.storage_account.azurerm_role_assignment.blob["iopitnwalletst01|*|owner|Storage Blob Data Owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow admins to manage blobs"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.storage_account.azurerm_role_assignment.blob["iopitnwalletst01|*|writer|PagoPA Storage Blob Tags Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to write blobs to Storage Account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Blob Tags Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.storage_account.azurerm_role_assignment.blob["iopitnwalletst01|*|writer|Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to write blobs to Storage Account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to manage queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|PagoPA Storage Queue Data Message Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to read messages from queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Queue Data Message Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to read messages from queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to read messages from queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to send messages to queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.storage_account.azurerm_role_assignment.blob["iopitnwalletst01|*|writer|PagoPA Storage Blob Tags Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user slot to write blobs to Storage Account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Blob Tags Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.storage_account.azurerm_role_assignment.blob["iopitnwalletst01|*|writer|Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user slot to write blobs to Storage Account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user slot to manage queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|PagoPA Storage Queue Data Message Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user slot to read messages from queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Queue Data Message Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user slot to read messages from queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user slot to read messages from queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user slot to send messages to queues"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 20 to add, 10 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.storage_accounts.azurerm_storage_queue.wallet-instance-creation-email-queue-01,
  on ../_modules/storage_accounts/storage_queue.tf line 3, in resource "azurerm_storage_queue" "wallet-instance-creation-email-queue-01":
   3:   storage_account_name = azurerm_storage_account.common.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 3 more similar warnings elsewhere)
```

</details>
